---
kind: property
id: P:Autodesk.Revit.DB.Events.DocumentCreatingEventArgs.Template
zh: 模板
source: html/634fd76a-8466-b705-b20d-b5a0c7303a80.htm
---
# Autodesk.Revit.DB.Events.DocumentCreatingEventArgs.Template Property

**中文**: 模板

The template file path to be used for creating the new document.

## Syntax (C#)
```csharp
public string Template { get; }
```